<template>
  <div class="bg-white z-[1] relative">
    <div @click="handleWarningTitleClick" class="flex items-center justify-center py-2 text-lg cursor-pointer select-none text-main">
      <span class="mr-2">警語</span>
      <img
        class="icon w-[14px]"
        :class="{ active: isShown }"
        src="@/assets/images/icon/arrow-up.png"
        alt="">
    </div>
    <div class="bg-[#f4f4f4]">
      <div class="pt-5 pb-1 px-7 max-w-[1110px] mx-auto">
        <div class="mb-3 text-lg font-bold text-darkGreen">中國信託投信獨立經營管理</div>
        <ul class="mb-5 ml-5 text-sm leading-relaxed list-disc">
          <li>網站資料僅供參考，請勿將其視為買賣基金或其他任何投資之建議或邀約。以上所作任何投資意見與市場分析結果，係依據資料製作當時情況進行判斷，本公司已力求資訊之正確與完整，惟文中之數據、預測或意見仍可能有脫漏或錯誤之處，本公司不保證本資料內容及來源資料之正確及完整性；或因市場環境變化已有變更，投資標的之價格與收益亦將隨時變動，投資人因不同時間進場，將有不同之投資績效，過去的績效亦不代表未來績效之保證，投資人應自行判斷投資標的、投資風險，或尋求專業之投資建議，不應將本資料內容引為投資之唯一依據，若有投資損益或因使用本資料所生之直接或間接損失，應由投資人自行負責。本公司或關係企業與其任何董事、受僱人不因此而承擔任何損害賠償責任。</li>
          <li>本公司系列基金雖經金管會核准或同意生效，惟不表示絕無風險。基金經理公司以往之經理績效不保證基金之最低投資收益；基金經理公司除盡善良管理人之注意義務外，不負責基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱基金公開說明書。為避免因受益人短線交易頻繁，造成基金管理及交易成本增加，進而損及基金長期 持有之受益人之權益，並稀釋基金之獲利，本基金不歡迎受益人進行短線交易。有關基金應負擔之費用（境外基金含分銷費用、反稀釋費用）已揭露於基金之公開說明書或投資人須知中，本公司及各銷售機構備有公開說明書，歡迎索取，或自行至本公司官網、公開資訊觀測站或境外基金資訊觀測站下載。</li>
          <li>本公司經理之基金，皆經金管會核准或同意生效在國內募集及銷售，惟並不表示絕無風險，本公司除盡善良管理人之注意義務外，不負責投資之盈虧，基金經理公司以往之經理績效不保證基金之最低投資收益，亦不必然為未來績效表現，投資人申購前應詳閱基金公開說明書。<strong class="text-red-500 underline">基金上市日前（不含當日），經理公司不接受基金受益權單位數之買回。</strong>基金應負擔之費用（含分銷費用）已揭露於基金之公開說明書中，投資人可前往本公司網站（www.ctbcinvestments.com）及公開資訊觀測站（mops.twse.com.tw）中查詢。各銷售機構均備有基金公開說明書，歡迎索取。匯率走勢亦可能影響所投資之海外資產而使資產價值變動。<strong class="text-red-500">本基金並無受存款保險、保險安定基金或其他相關保障機制之保障。故投資本基金可能發生部分或全部本金之損失，最大可能損失則為全部投資金額。金融消費爭議處理及申訴管道：就本公司所提供之金融商品或服務所生紛爭投資人應先向本公司提出申訴，若三十日內未獲回覆或投資人不滿意處理結果得於六十日內向「金融消費評議中心」申請評議。</strong></li>
          <li>本基金以追蹤標的指數報酬為操作目標，而標的指數之成分證券價格波動將影響標的指數的走勢，當標的指數的成分證券價格波動劇烈或變化時，本基金之淨資產價值亦承受大幅波動的風險。因下列因素仍可能使基金報酬偏離標的指數報酬，且偏離方向無法預估：1.基金可能受成本費用、投資組合價格波動或基金整體曝險比例等因素的影響而使基金報酬與投資目標產生偏離。2.基金如持有期貨部位，基金淨值將同時承受期貨及債券對市場信息反應不一而產生的追蹤偏離。3.基金承受相關匯率波動風險可能使基金報酬與投資目標產生偏離。</li>
          <li><strong class="text-red-500">本文提及之經濟走勢預測不必然代表基金之績效，有關本公司之基金運用限制及投資風險請詳閱基金公開說明書。</strong></li>
          <li><strong class="text-red-500">本公司基金配息率不代表基金報酬率，且過去配息率不代表未來配息率，基金淨值可能因市場因素而上下波動，於獲配息時須一併注意基金淨值之變動。</strong></li>
          <li>本公司基金公開說明書之內容如有虛偽或隱匿之情事者，應由本經理公司及負責人與其他曾在公開說明書上簽章者依法負責。</li>
          <li><strong class="text-red-500">基金上市/上櫃日前（不含當日），經理公司不接受基金受益權單位數之買回。投資人於基金成立日（不含當日）前參與申購所買入的基金每受益權單位之發行價格，不等同於基金掛牌上市/上櫃之價格，參與申購投資人需自行承擔基金成立日起自掛牌日止期間之基金淨資產價格波動所產生折/溢價的風險，各子基金上市/上櫃後的次級市場成交價格亦可能不同於基金每營業日結算所得之淨值，而有折/溢價之交易風險。基金受益憑證上市/上櫃後之買賣成交價格無升降幅度限制，並應依臺灣證交所所有關規定辦理。惟投資人應注意盤中估計淨值與實際淨值可能有誤差值之風險，經理公司於臺灣證券交易時間內提供的各子基金盤中估計淨值僅供投資人參考，實際淨值應以本公司最終公告之每日淨值為準。</strong></li>
        </ul>
      </div>
    </div>
    <div class="mx-auto overflow-hidden bg-[#f4f4f4]">
      <Collapse :when="isShown">
        <div class="px-7 max-w-[1110px] mx-auto">
          <div class="mb-3 text-lg font-bold text-darkGreen">【中國信託全球收益ETF傘型基金】</div>
          <ul class="mb-5 ml-5 text-sm leading-relaxed list-disc">
            <li>基金之操作目標在追蹤與標的指數相關之報酬（中國信託15年期以上新興市場美元主權低碳債券ETF證券投資信託基金之標的指數為ICE15年期以上新興市場美元主權低碳債券指數）及（中國信託15年期以上已開發市場ESG投資級美元公司債券ETF證券投資信託基金之標的指數為ICE15年期以上已開發市場ESG美元投資級公司債券指數）及（中國信託恒生中國高股息ETF之標的指數為恒生中國高股息率指數）。</li>
            <li>本基金經金融監督管理委員會（以下簡稱「金管會」）同意生效，惟不表示本基金絕無風險。經理公司以往之經理績效不保證本基金之最低投資收益；經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱本基金公開說明書。基金上市/上櫃日前（不含當日），經理公司不接受基金受益權單位數之買回。</li>
            <li>本基金並無受存款保險、保險安定基金或其他相關保障機制之保障。故投資本基金可能發生部分或全部本金之損失，最大可能損失則為全部投資金額。金融消費爭議處理及申訴管道：就本公司所提供之金融商品或服務所生紛爭投資人應先向本公司提出申訴，若三十日內未獲回覆或投資人不滿意處理結果得於六十日內向「金融消費評議中心」申請評議。</li>
          </ul>
          <div class="mb-3 text-lg font-bold text-darkGreen">【中國信託全球收益ETF傘型基金】</div>
          <ul class="mb-5 ml-5 text-sm leading-relaxed list-disc">
            <li>基金之操作目標在追蹤與標的指數相關之報酬（中國信託15年期以上新興市場美元主權低碳債券ETF證券投資信託基金之標的指數為ICE15年期以上新興市場美元主權低碳債券指數）及（中國信託15年期以上已開發市場ESG投資級美元公司債券ETF證券投資信託基金之標的指數為ICE15年期以上已開發市場ESG美元投資級公司債券指數）及（中國信託恒生中國高股息ETF之標的指數為恒生中國高股息率指數）。</li>
            <li>本基金經金融監督管理委員會（以下簡稱「金管會」）同意生效，惟不表示本基金絕無風險。經理公司以往之經理績效不保證本基金之最低投資收益；經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱本基金公開說明書。基金上市/上櫃日前（不含當日），經理公司不接受基金受益權單位數之買回。</li>
            <li>本基金並無受存款保險、保險安定基金或其他相關保障機制之保障。故投資本基金可能發生部分或全部本金之損失，最大可能損失則為全部投資金額。金融消費爭議處理及申訴管道：就本公司所提供之金融商品或服務所生紛爭投資人應先向本公司提出申訴，若三十日內未獲回覆或投資人不滿意處理結果得於六十日內向「金融消費評議中心」申請評議。</li>
          </ul>
          <div class="mb-3 text-lg font-bold text-darkGreen">【中國信託全球收益ETF傘型基金】</div>
          <ul class="mb-5 ml-5 text-sm leading-relaxed list-disc">
            <li>基金之操作目標在追蹤與標的指數相關之報酬（中國信託15年期以上新興市場美元主權低碳債券ETF證券投資信託基金之標的指數為ICE15年期以上新興市場美元主權低碳債券指數）及（中國信託15年期以上已開發市場ESG投資級美元公司債券ETF證券投資信託基金之標的指數為ICE15年期以上已開發市場ESG美元投資級公司債券指數）及（中國信託恒生中國高股息ETF之標的指數為恒生中國高股息率指數）。</li>
            <li>本基金經金融監督管理委員會（以下簡稱「金管會」）同意生效，惟不表示本基金絕無風險。經理公司以往之經理績效不保證本基金之最低投資收益；經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱本基金公開說明書。基金上市/上櫃日前（不含當日），經理公司不接受基金受益權單位數之買回。</li>
            <li>本基金並無受存款保險、保險安定基金或其他相關保障機制之保障。故投資本基金可能發生部分或全部本金之損失，最大可能損失則為全部投資金額。金融消費爭議處理及申訴管道：就本公司所提供之金融商品或服務所生紛爭投資人應先向本公司提出申訴，若三十日內未獲回覆或投資人不滿意處理結果得於六十日內向「金融消費評議中心」申請評議。</li>
          </ul>
        </div>
      </Collapse>
    </div>
  </div>
</template>
<script setup>
import { Collapse } from 'vue-collapsed'

defineProps({
  isShown: Boolean,
})
const emit = defineEmits(['toggle-warning-area'])

const handleWarningTitleClick = () => {
  emit('toggle-warning-area')
}
</script>
<style lang="scss" scoped>
.icon {
  transform: rotate(180deg);
  &.active {
    transform: rotate(0deg);
  }
}

</style>