<template>
  <GradientBackground :mobile-position="190" :desktop-position="210" />
  <div class="page-layout">
    <Breadcrumb :list="breadCrumbList" />
    <PageTitle :size="25" title="隱私權政策" :imagePath="IconLockPath" />
    <div class="leading-7 content">
      <div class="block-with-bottom-space">
        <p>
          親愛的客戶，歡迎您光臨中國信託投信網站(下稱本網站)，為了讓您能夠安心的使用本網站為您所提供的各項服務，並允許本網站在必要時記錄、使用您個人所提供的相關資訊，以便提供你更貼心的服務。中國信託投信(下稱本公司)在此先向您說明我們網站的隱私權保護政策，以及本公司對您所提供的任何資料的絕對保護及尊重。除依法令規範或您與本行另有其他約定外，本公司將依循本隱私權保護政策內容辦理。
        </p>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="一、本網站個人資料之蒐集來源" />
        <div class="block-indent">
          <p>本公司將根據於本網站所提供的不同服務，向使用者蒐集個人資料：</p>
          <ul class="list-custom-cjk">
            <li>
              線上申請及網路市場調查
              當您於本網站參與線上申請或網路調查時，本公司可能會請您提供姓名、身份證字號、電話、e-mail、住址及其他相關必要資料。
            </li>
            <li>
              網站內容服務
              當您申請註冊成為本網站之會員時，根據本網站提供服務性質不同，本公司可能會請您提供個人資料，包括：姓名、暱稱、住址、電話、電子信箱及其他相關必要資料。
            </li>
            <li>
              其他
              除了上述項目外，本公司也會保留您在本網站瀏覽或查詢時，伺服器自行產生的相關記錄，包括您使用連線設備的IP位址、設備資訊、使用時間、使用的瀏覽器、瀏覽及點選資料紀錄等。本公司會對個別連線者的瀏覽器予以標示，歸納使用者瀏覽器在本網站內部所瀏覽的網頁，除非您
              願意告知或提供你的個人資料，否則公司不會，也無法將此項記錄和您對應。請您注意，與本網站連結的其他網站，也可能蒐集您個人的資料。對於您於前述連結網站主動提供的個人資料，將
              依相關法令及各該連結網站所揭露之隱私權保護政策蒐集、利用與處理，不適用本網站之隱私權保護政策，本公司也不負擔任何連帶責任。
            </li>
          </ul>
        </div>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="二、本網站上述蒐集資料之運用政策" />
        <div class="block-indent">
          <ul class="list-custom-cjk">
            <li>
              線上申請及網路市場調查
              本公司於本網站所蒐集的申請或受訪者姓名、身分證字號、電話、e-mail、住址及其他個人資料，
              除依法令規定或經您書面同意外，僅於本公司蒐集之特定目的(包含申辦本公司基金、參加本網站抽獎活動或市場調查分析)必要範圍內處理及利用，本公司不會將前述個人資料用做其他用途。本公司並將依法令規範對前述個人資料負保密之責，絕不會公布個別申請者或受訪者之任何個人資訊。
            </li>
            <li>
              個人資料之查詢、閱覽及刪除
              對於本公司透過本網站所蒐集與保存您的個人資料，除法令另有規定外，您可以向本公司：1.查詢或請求閱覽您的個人資料；2.請求製給您個人資料之複製本。3.請求補充或更正您的個人資料。4.請求停止蒐集、利用或處理您的個人資料；或5.請求刪除您的個人資料。您得隨時向本公司提出上述申請，本公司將依個人資料保護法及法令遵循或內部控制等相關法令規範，據以決定或受理您的申請。
            </li>
            <li>
              其他
              當您在本網站主動註冊成為會員後，其所輸入的資料，僅供本網站依服務或活動設計參考使用。
              凡未經您主動註冊所產生的資料，例如使用者連線設備的 IP
              位址、設備資訊、使用時間、使用的瀏覽器、瀏覽及點選紀錄等資料，本公司僅會在對本網站全體使用者整體行為進行統計分析之特定目的必要範圍內利用及處理，並不會對個別使用者進行分析。
            </li>
          </ul>
        </div>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="三、Cookies的運用與政策" />
        <div class="block-indent">
          <p>
            Cookies是伺服端為了區別使用者的不同喜好，經由瀏覽器寫入使用者硬碟的一些簡短資訊。您
            可以在Firefox瀏覽器的「工具選項」的「個人隱私」項目或是 IE 瀏覽器的「網際網際網路選項」
            的「隱私權」項目中選擇修改您瀏覽器對 Cookies 的接受程度。如果您選擇「拒絕所有的
            cookies」， 您就可能無法使用部份個人化服務，或是參與部份的活動。
            依據以下目的及情況，本網站會在 本政策原則下，在您瀏覽器中寫入並讀取
            Cookies：（1）為提供更好、更個人化的服務，以及方 便您參與個人化的互動活動。cookies
            在您註冊或登入時建立，並在您登出時修改。（2）為統計
            瀏覽人數及分析瀏覽模式，以了解網頁瀏覽的情況，做為本網站改善服務的參考。
          </p>
        </div>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="四、本網站個人資料提供予第三者之政策" />
        <div class="block-indent">
          <ul class="list-custom-cjk">
            <li>
              本公司絕不會任意出售、交換、出租或以其他方式提供任何您的個人資料給其他團體或個人。但在下列兩種狀況，本公司會在符合法令規範及依循下列原則之前提下，將透過本網站所蒐集之您的個人資料提供予第三者。個人資料之查詢、閱覽及刪除
            </li>
            <li>
              為了提供您由本公司與第三者合作提供之服務或優惠權益給您，而需要與合作提供該服務或優惠之第三者共用您的資料時，本公司會在本網站網頁刊載或揭露相關完整說明，並且在向您為資料蒐集之前進行告知，您可以自由選擇是否為享有前述合作提供之服務或優惠權益而提供您的個人資料。
            </li>
            <li>
              司法、金融監理、稅務及其他依法具調查權之公務機關依法令規定，要求本公司提供特定個人資料時，本公司將於確認前述公務機關已循合法正式的程序，並兼顧對本網站所有使用者安全考量下，於特定目的必要範圍內配合。
            </li>
          </ul>
        </div>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="五、本網站傳送商業資訊或電子郵件之政策" />
        <div class="block-indent">
          <ul class="list-custom-cjk">
            <li>
              本公司將在事前或經由註冊登錄方式取得您的同意後，透過本網站傳送商業性資料或電子郵件至您留存於本公司之電子郵件信箱。
            </li>
            <li>
              本公司除了在前述資料或電子郵件上註明是由本公司發送外，也會在前述資料或電子郵件上提供您能隨時停止接收這些資料或電子郵件的方法、說明或功能連結。
              如為了提供您其他服務或優
              惠權益需要與提供該服務或優惠的第三者傳送商業性資料或電子郵件時，我們將會在活動時提供充分的說明，並且在進行第三者傳輸之前通知您，您可以自由選擇是否接受這項特定服務或活動。
            </li>
          </ul>
        </div>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="六、自我保護措施" />
        <p>
          請妥善保管您的密碼及或任何個人資料，不要將任何個人資料，尤其是密碼提供給任何人。在您使用完本公司於本網站所提供的各項服務功能後，務必記得登出帳戶，若您是與他人共享電腦或
          使用公共電腦，切記要關閉瀏覽器視窗，以防止他人讀取您的個人資料或信件。
        </p>
      </div>

      <div class="block-with-bottom-space">
        <PageSubTitle title="七、隱私權保護政策聲明" />
        <div class="block-indent">
          <ul class="list-custom-cjk">
            <li>
              本網站使用者如果對於本隱私權保護政策或與個人資料有關之事項有疑義，可與本公司客服中心
              聯絡，本公司會提供最完整的說明。
            </li>
            <li>
              本公司將會依相關法令規範並視實際需要，修改本網站所提供的隱私權保護政策，以落實保障您
              隱私權之立意。當本公司完成隱私權保護政策內容修改後，將立即刊登公告於本網站上。
            </li>
            <li>
              本公司對本網站內容保留一切法律權利，非經本公司授權使用或同意，本網站資料均不得以任何
              形式、利用任何方式予以重製、轉載。
            </li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>
<script setup>
import IconLockPath from '@/assets/images/icon/lock.png'
const ROUTE_NAME = inject('ROUTE_NAME')

const breadCrumbList = [
  { name: '首頁', routeName: ROUTE_NAME.home.name },
  { name: '隱私權政策', routeName: undefined }
]
</script>

<style lang="scss" scoped>
@import '@/assets/scss/pages/footer-pages.scss';
</style>